post/dtach/index.html
<!DOCTYPE html>
<html lang="vi-vn">
<head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <title> Dtach | MẤY KHI MẤY KHỈ</title>
  
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <meta name="robots" content="all,follow">
  <meta name="googlebot" content="index,follow,snippet,archive">
  <meta property="og:title" content="Dtach" />
<meta property="og:description" content="Trực chỉ nhân tâm - Đi thẳng vô vấn đề    Nhớ năm xưa, khi còn vọc i3 khá nhiều, còn thường restart luôn cả window manager. Mình hay bị lost các terminal đang chạy các process cần thiết.
  Đi làm để máy bật ở công ty qua đêm, về nhà thì cần ssh vô máy ở công ty, cần connect lại các process đang chạy trên terminal (Case này thì dùng vnc cũng được, nhưng mình thích terminal hơn nhiều)" />
<meta property="og:type" content="article" />
<meta property="og:url" content="/post/dtach/" />
<meta property="article:published_time" content="2023-07-08T11:50:22+07:00" />
<meta property="article:modified_time" content="2023-07-08T11:50:22+07:00" />

  <meta name="twitter:card" content="summary"/>
<meta name="twitter:title" content="Dtach"/>
<meta name="twitter:description" content="Trực chỉ nhân tâm - Đi thẳng vô vấn đề    Nhớ năm xưa, khi còn vọc i3 khá nhiều, còn thường restart luôn cả window manager. Mình hay bị lost các terminal đang chạy các process cần thiết.
  Đi làm để máy bật ở công ty qua đêm, về nhà thì cần ssh vô máy ở công ty, cần connect lại các process đang chạy trên terminal (Case này thì dùng vnc cũng được, nhưng mình thích terminal hơn nhiều)"/>

  
  
    
  
  
  <link rel="stylesheet" href="/css/style-light.css">
  
  
  
    <!--[if lt IE 9]>
    <![endif]-->
  

  
<link rel="icon" type="image/png" href="/images/favicon.ico" />

  
  
</head>

<body class="max-width mx-auto px3 ltr">
  <div class="content index py4">

    <header id="header">
  <a href="/">
  
    <div id="logo" style="background-image: url(https://avatars.githubusercontent.com/u/9713793?s=64)"></div>
  
  <div id="title">
    <h1>MẤY KHI MẤY KHỈ</h1>
  </div>
  </a>
  <div id="nav">
    <ul>
      <li class="icon">
        <a href="#"><i class="fas fa-bars fa-2x"></i></a>
      </li>
      
        <li><a href="/post/intro">Intro</a></li>
      
        <li><a href="/post">Writings</a></li>
      
    </ul>
  </div>
</header>



    
<article class="post" itemscope itemtype="http://schema.org/BlogPosting">

  <div class="content" itemprop="articleBody">
  
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Trực chỉ nhân tâm - Đi thẳng vô vấn đề
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>
<p>Nhớ năm xưa, khi còn vọc i3 khá nhiều, còn thường restart luôn cả window manager. Mình hay bị lost các terminal đang chạy các process cần thiết.</p>
</li>
<li>
<p>Đi làm để máy bật ở công ty qua đêm, về nhà thì cần ssh vô máy ở công ty, cần connect lại các process đang chạy trên terminal (Case này thì dùng vnc cũng được, nhưng mình thích terminal hơn nhiều)</p>
</li>
</ul>
<p>Mình cần một chương trình để giữ các process mỗi khi một terminal được khởi chạy mới.</p>
<p>
Tất nhiên là mình đang dùng <code>screen</code> và <code>tmux</code> cho các session chính mình cần, nhưng trong trường hợp này, mình muốn nó thật đơn giản vì muốn áp dụng cho toàn bộ các terminal được bật.</p>
<p>
Chức năng cần thì càng KISS càng tốt:</p>
<ul>
<li>
<p>Chỉ cần attach và không cần detach ở trong chính session đó</p>
</li>
<li>
<p>Cũng không cần multi-session.</p>
</li>
<li>
<p>Không một phím tắt nào để tương tác với trình quản lý này</p>
</li>
</ul>
<p>Và <code>dtach - simple program that emulates the detach feature of screen.</code> đã được mình phát hiện. (Một phát hiện mang tính chiến lược.)</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Sử dụng
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>Mỗi lần bật terminal, mình sẽ bật terminal và chạy <code>dtach</code> luôn, vì thế mà rất trong suốt với người dùng.</p>
<p>
Viết 1 cái script như sau:</p>
<ul>
<li>
<p><code>~/.i3/bin/dtach</code></p>
</li>
</ul>
<div class="src src-sh">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-sh" data-lang="sh"><span style="color:#75715e">#!/usr/bin/env bash
</span><span style="color:#75715e"></span>WS<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>i3-msg -t get_workspaces   | jq <span style="color:#e6db74">&#39;.[] | select(.focused==true).num&#39;</span><span style="color:#66d9ef">)</span>
urxvt -e dtach -A <span style="color:#e6db74">&#34;/tmp/.</span><span style="color:#e6db74">${</span>LOGNAME<span style="color:#e6db74">}</span><span style="color:#e6db74">_term_</span><span style="color:#e6db74">${</span>WS<span style="color:#e6db74">}</span><span style="color:#e6db74">.dtach&#34;</span> -E -z bash -l</code></pre></div>
</div>
<div class="src src-markdown">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-markdown" data-lang="markdown">------- ChatGPT(modified):

Dòng 1: Gán biến WS bằng kết quả của lệnh &#34;i3-msg -t get_workspaces&#34;
sau đó dùng jq để lọc và chọn workspace đang được focus và lấy số của nó.

Dòng 2: Dùng lệnh urxvt để mở terminal và thực thi lệnh dtach với tùy
chọn &#34;-A&#34; để liên kết vào một session tồn tại (nếu có hoặc tạo mới nếu
chưa tồn tại), tên session được đặt tên theo user (LOGNAME), workspace hiện
tại (WS) và đuôi &#34;.dtach&#34;.
-E là tắt phím detach.
-z là tắt phím suspend, tức là bấm C-z không có hiệu lực lên dtach, mà lên chương trình chạy bên trong.
Lếnh bash -l để chạy một shell bash login</code></pre></div>
</div>
<p>
Tiếp theo là gắn cho phím mở terminal bằng script này</p>
<ul>
<li>
<p><code>~/.i3/config</code></p>
</li>
</ul>
<div class="src src-diff">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-diff" data-lang="diff"> # start a terminal
<span style="color:#f92672">-bindsym $mod+Return exec i3-sensible-terminal
</span><span style="color:#f92672"></span><span style="color:#a6e22e">+bindsym $mod+Return exec ~/.i3/bin/dtach
</span></code></pre></div>
</div>
<p>
Vì là mặc định giờ sẽ luôn bật terminal và chạy <code>dtach</code> luôn. Nên sẽ cần 1 cái phím khác để chạy thuần terminal để có thể attach vào các session đã tốn tại.
Nên mình thêm 1 config mới</p>
<div class="src src-diff">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-diff" data-lang="diff"> # start a terminal
 bindsym $mod+Return exec ~/.i3/bin/dtach
<span style="color:#a6e22e">+bindsym $mod+Shift+Return exec i3-sensible-terminal
</span></code></pre></div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
Khi nào thì attach vào
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>Như bài toán đã đề ra, khi lỡ bị đóng mất cái terminal hoặc cần attach khi ở trong SSH thì rất dễ để attach lại session cũ.</p>
<div class="src src-bash">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">dtach -A /tmp/SESSION_PATH.dtach -E -z bash -l</code></pre></div>
</div>
<p>
Đoạn này để tiện cho việc chạy thì viết thêm 1 cái wrapper script như sau:</p>
<ul>
<li>
<p><code>/usr/local/bin/dtacha</code></p>
</li>
</ul>
<div class="src src-bash">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash"><span style="color:#75715e">#!/usr/bin/env bash
</span><span style="color:#75715e"></span>dtach -A $1 -E -z bash -l</code></pre></div>
</div>
<ul>
<li>
<p><code>/etc/bash_completion.d/dtacha</code></p>
</li>
</ul>
<div class="src src-bash">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash">_dtacha<span style="color:#f92672">(){</span>
    <span style="color:#66d9ef">if</span> <span style="color:#f92672">[</span> -z <span style="color:#e6db74">&#34;</span>$TMPDIR<span style="color:#e6db74">&#34;</span> <span style="color:#f92672">]</span>; <span style="color:#66d9ef">then</span>
        export TMPDIR<span style="color:#f92672">=</span>/tmp
    <span style="color:#66d9ef">fi</span>
    local cur prev words cword opts
    _get_comp_words_by_ref -n : cur prev words cword
    COMPREPLY<span style="color:#f92672">=()</span>
    opts<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span>
    <span style="color:#66d9ef">if</span> <span style="color:#f92672">[[</span> <span style="color:#e6db74">${</span>cword<span style="color:#e6db74">}</span> -eq <span style="color:#ae81ff">1</span> <span style="color:#f92672">]]</span>;<span style="color:#66d9ef">then</span>
        opts<span style="color:#f92672">=</span><span style="color:#66d9ef">$(</span>find <span style="color:#e6db74">&#34;</span>$TMPDIR<span style="color:#e6db74">&#34;</span> -name <span style="color:#e6db74">&#34;.*term*&#34;</span> 2&gt;/dev/null<span style="color:#66d9ef">)</span>
    <span style="color:#66d9ef">fi</span>
    COMPREPLY<span style="color:#f92672">=(</span> <span style="color:#66d9ef">$(</span>compgen -W <span style="color:#e6db74">&#34;</span>$opts<span style="color:#e6db74">&#34;</span> -- <span style="color:#e6db74">&#34;</span><span style="color:#e6db74">${</span>cur<span style="color:#e6db74">}</span><span style="color:#e6db74">&#34;</span><span style="color:#66d9ef">)</span><span style="color:#f92672">)</span>
<span style="color:#f92672">}</span>
complete -F _dtacha dtacha</code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Tích hợp với Emacs
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>Vấn đề tương tự nảy sinh với Emacs, đó là Emacs sẽ crash nếu mình làm việc/phá quá nhiều. Và khi crash ta lại mất các process đang chạy trong các shell của Emacs.
Thế là mình biết 1 cái command như sau.</p>
<div class="src src-elisp">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-elisp" data-lang="elisp">(defun shell-dtach ()
  <span style="color:#e6db74">&#34;Start dtach in shell.&#34;</span>
  (interactive)
  (let* ((explicit-shell-file-name <span style="color:#e6db74">&#34;dtach&#34;</span>)
         (file-name (<span style="color:#a6e22e">concat</span> <span style="color:#e6db74">&#34;/tmp/&#34;</span>
                            (replace-regexp-in-string
                             <span style="color:#e6db74">&#34;/&#34;</span> <span style="color:#e6db74">&#34;~&#34;</span> default-directory) <span style="color:#e6db74">&#34;.dtach&#34;</span>))
         (explicit-dtach-args <span style="color:#f92672">`</span>(<span style="color:#e6db74">&#34;-A&#34;</span> <span style="color:#f92672">,</span>file-name <span style="color:#e6db74">&#34;-z&#34;</span>
                                <span style="color:#e6db74">&#34;/bin/bash&#34;</span> <span style="color:#e6db74">&#34;--noediting&#34;</span> <span style="color:#e6db74">&#34;-login&#34;</span>)))
    (shell (<span style="color:#a6e22e">format</span> <span style="color:#e6db74">&#34;*dtach:%s*&#34;</span> default-directory))))</code></pre></div>
</div>
<p>
Thấy việc này có vẻ sẽ hay ho để viết 1 cái gói Emacs để tương tác với dtach.
Thật may đúng thời điểm đó đã có 1 người giới thiệu một gói. <a href="https://sr.ht/~niklaseklund/detached.el">https://sr.ht/~niklaseklund/detached.el</a> như một định mệnh.</p>
<p>
Hm, lúc mới thử thì mình chưa thấy nó match với cái mình cần, hoặc do chưa biết dùng, nên chưa sử dụng.
Bẵng đi một thời gian, thì gói này càng phát triển, và còn được release trên <code>https://elpa.gnu.org/packages/</code> luôn.
Mình quay trở lại và dùng thử, ngon rồi đây. Đây cũng chính là triết lý sống <code>Do nothing</code> nằm yên đợi tùy duyên =))</p>
<p>
Mình đã config nó vào Emacs của mình <a href="https://github.com/TxGVNN/dots/blob/52d4cdeb7b2c340cb4883e7541deda904e6a7f3e/.emacs#L780">TxGVNN/dots:.emacs#detached</a>. Và sau một thời gian mình patch thêm 1 số cái <a href="https://github.com/TxGVNN/guxti/blob/8d8a4ce0ea4ddea315454866262cbdda9741b6ee/guxti/packages/emacs-xyz.scm#L396">TxGVNN/guxti:guxti/packages/emacs-xyz.scm#L396</a>. Chắc sẽ patch thêm 1 số cái mà mình thấy đang cần, như re-run chưa load lại env từ direnv.</p>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Attach lại trên terminal
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
Gói <code>detached</code> trên Emacs đã giải quyết bài toán rất ngon, nhưng giờ mình lại cần attach lại các session này (ở Emacs) lên terminal.
Thế thì phải viết thêm 1 số mã, sử dụng Emacs làm interface để mà chọn session cần attach.</p>
<ul>
<li>
<p>~/.emacs.d/init.el</p>
</li>
</ul>
<div class="src src-elisp">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-elisp" data-lang="elisp">(defun detached-attach-session-to-copy-xclip (session)
  <span style="color:#e6db74">&#34;Attach to SESSION.&#34;</span>
  (interactive
   (<span style="color:#a6e22e">list</span> (detached-session-in-context)))
  (when (and session
             (detached--valid-dtach-executable-p session))
    (let ((initialized-session (detached--get-initialized-session session)))
      (if (detached-session-inactive-p initialized-session)
          (detached-open-session initialized-session))
      (setq command (detached-session-attach-command session :type <span style="color:#e6db74">&#39;string</span>))
      (xclip-set-selection <span style="color:#e6db74">&#39;primary</span> command))))</code></pre></div>
</div>
<p>
Với <code>detached-attach-session-to-copy-xclip</code>, Emacs sẽ hiện danh sách các session, sau đó thì mình chọn 1 cái.
Tiếp đến là copy nó vào trong primary keyboard bởi xclip</p>
<ul>
<li>
<p>/usr/local/bin/detached</p>
</li>
</ul>
<div class="src src-bash">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-bash" data-lang="bash"><span style="color:#75715e">#!/usr/bin/env bash
</span><span style="color:#75715e"></span>EMACS_SOCKET<span style="color:#f92672">=</span><span style="color:#e6db74">${</span>EMACS_SOCKET<span style="color:#66d9ef">:-</span><span style="color:#e6db74">&#34;server&#34;</span><span style="color:#e6db74">}</span>
emacsclient -nw -s $EMACS_SOCKET --eval <span style="color:#e6db74">&#34;(call-interactively &#39;detached-attach-session-to-copy-xclip)&#34;</span> --eval <span style="color:#e6db74">&#34;(call-interactively &#39;save-buffers-kill-terminal)&#34;</span>
xdotool key --clearmodifiers Shift+Insert</code></pre></div>
</div>
<p>
Triệu hồi chatgpt</p>
<div class="src src-md">
<div class="highlight"><pre style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-md" data-lang="md">
------- assistant:

EMACS_SOCKET=${EMACS_SOCKET:-&#34;server&#34;}
# Gán biến EMACS_SOCKET giá trị mặc định là &#34;server&#34; nếu nó chưa được đặt trước đó

emacsclient -nw -s $EMACS_SOCKET --eval &#34;(call-interactively &#39;detached-attach-session-to-copy-xclip)&#34; --eval &#34;(call-interactively &#39;save-buffers-kill-terminal)&#34;
# Sử dụng emacsclient để gửi các lệnh tới emacs đã chạy sẵn.
# -nw: Chế độ không hiển thị cửa sổ Emacs
# -s $EMACS_SOCKET: Kết nối đến Emacs qua ổ định socket $EMACS_SOCKET
# --eval &#34;(call-interactively &#39;detached-attach-session-to-copy-xclip)&#34;: Gọi hàm &#34;detached-attach-session-to-copy-xclip&#34; trong Emacs
# --eval &#34;(call-interactively &#39;save-buffers-kill-terminal)&#34;: Gọi hàm &#34;save-buffers-kill-terminal&#34; trong Emacs

xdotool key --clearmodifiers Shift+Insert
# Gửi sự kiện bàn phím &#34;Shift+Insert&#34; bằng công cụ xdotool, với tùy chọn để xóa bỏ các phím modifier hiện tại.</code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
Ghi chú
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>Do mình không cần phím detach nào trong dtach session(<code>-E   Disables the detach character</code>). Nên lúc cần detach thì đơn giản là tìm đến process của dtach đó và gửi signal <code>HUP</code> tới process đó.</p>
</div>
</div>

  
  </div>
</article>


    <footer id="footer">
  <div class="footer-left">
    Copyright  &copy; 2023  MẤY KHI MẤY KHỈ 
  </div>
  <div class="footer-right">
    <nav>
      <ul>
         
        <li><a href="/post/intro">Intro</a></li>
         
        <li><a href="/post">Writings</a></li>
        
      </ul>
    </nav>
  </div>
</footer>


  </div>
</body>

<link rel="stylesheet" href=/lib/font-awesome/css/all.min.css>
<script src=/lib/jquery/jquery.min.js></script>
<script src=/js/main.js></script>
</html>
